
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 19.5
___/   /   /___/   /   /___/       SE—Standard Edition

 Statistics and Data Science       Copyright 1985-2025 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user network, expiring 22 Jan 2027
Serial number: 401909301783
  Licensed to: Aubrey Jolex
               Innovations for Poverty Action

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. Maximum number of variables is set to 32,767; see help set_maxvar.

. do C:\Users\AJolex\Box\16566_psps_international_care_ministries_livelihoods\0
> 6_Data_Management_System\ICM_Business_module\0_master.do 

. *****************************************************************************
> ***
. **      TITLE   : 00_master.do
. **      PURPOSE : Master do file
. **  PROJECT     :               
. **      AUTHOR  : 
. **      DATE    : 
. *****************************************************************************
> ***
. **# setup Stata
. *----------------------------------------------------------------------------
> --*
.         
.         cls

.         clear                   all

.         macro drop              _all

.         version                 17

.         set maxvar              32767


.         set matsize     11000
set matsize ignored.
    Matrix sizes are no longer limited by c(matsize) in modern Statas.
    Matrix sizes are now limited by edition of Stata.  See limits for more
    details.

.         set more                off

.         
.         set seed                20250526

.         
.         
.         if inlist(c(username),"AJolex") {
.                 global BOX "C:/Users/`c(username)'/Box/16566_psps_internation
> al_care_ministries_livelihoods"
.         }

.         
.         else if "`c(username)'" == "Other" {
.                 global BOX "C:/Users/Other/Box/16566_psps_international_care_
> ministries_livelihoods"
.         }

. 
.         gl secure "F:/10_Livelihood/PSPS ICM Livelihoods Study/10_ICM Follow 
> up survey/Data Management System"

.         gl public "$BOX/06_Data_Management_System"

. 
.         
.         gl secure_hh "$secure/ICM Business module"      

.         gl public_hh "$public/ICM_Business_module"

. 
. **# Survey 1
. *----------------------------------------------------------------------------
> --*
. 
.         do "2_dofiles/1_globals.do"                                          
>                                                            // globals do-file
file 2_dofiles/1_globals.do not found
r(601);

end of do-file
r(601);
